Revit 2026 API

# FamilyInstanceCreationData Class

---

A class which wraps the arguments of FamilyInstance for batch creation.

SystemObject Autodesk.Revit.CreationFamilyInstanceCreationData

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyInstanceCreationData
```
```vb
Public Class FamilyInstanceCreationData
```
```cpp
public ref class FamilyInstanceCreationData
```
```fsharp
type FamilyInstanceCreationData = class end
```

The FamilyInstanceCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyInstanceCreationData(Object) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(FamilySymbol, IListXYZ) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(Face, Line, FamilySymbol) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |
|  | FamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class |

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Get or set the axis of the FamilyInstance |
|  | RotateAngle | Get or set the rotate angle of the FamilyInstance |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.Creation Namespace